<template>
	<view class="container">
		<topBar :nav="setNav"></topBar>
		<view class="title">
			隐私政策
		</view>
		<view class="content">
			<view class="line">
				在注册前务必认真阅读本协议的内容、充分理解各条款内容，如有异议，您可选择不进入濠江珠浦种子会小程序(以下简称种子会)。
			</view>
			<view class="line">
				种子会尊重并保护所有使用服务用户的个人隐私权，高度重视用户的隐私及个人信息的保护，本隐私政策帮助您了解我们收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。
			</view>
			<view class="line">
				我们将依据《中华人民共和国网络安全法》、《信息安全技术个人信息安全规范》以及其他相关法律法规、业界成熟的安全标准收集和本协议的约定使用您的个人信息，除本隐私权政策另有规定外，在未征得您事先许可的情况下，种子会不会将这些信息对外披露或向第三方提供。
			</view>
			<view class="line">
				收集和使用个人信息的范围。
			</view>
			<view class="line">
				注册账号：您注册并登录种子会账号时至少向我们提供账号名称、头像、手机号码或电子邮箱，并创建密码。注册成功后，您提供的上述信息，将在您使用种子会平台和服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除上述信息或对您的个人信息进行匿名化处理，法律法规另有规定的除外。
			</view>
			<view class="line">身份认证服务：种子会提供身份认证服务，当您申请成为种子会用户为您进行身份认证时我们需要收集您的出生日期、时间、出生地点有关身份证明的信息。 </view>
			<view class="line">信息发布功能：您注册成功后，可在种子会平台发布信息，对信息的内容，我们将不时进行审核，并根据法律规定对该内容进行保存。 </view>
			<view class="line">浏览、关注、收藏功能：您可浏览已关注或已加好友的发表的信息，我们将对你浏览、关注、收藏的记录信息进行审核，自动收集您使用种子会的详细情况，并根据法律规定对该内容进行保存。
			</view>
			<view class="line">展示和推送内容：通过使用收集的信息，我们会向您提供搜索结果、个人化内容、用户研究分析与统计等服务。 </view>
			<view class="line">
				搜索功能：当您使用种子会提供的搜索功能时，我们会收集您查询的关键字信息以及您在使用种子会服务时所阅览或要求的其他信息和内容详情。该等关键词信息通常无法单独识别您的个人身份，不属于您的个人信息，不在本指引的限制范围内。只有当您的搜索关键词信息与您的其他信息有联结并可识别您的个人身份时，则在结合使用期间，我们会将您的搜索关键词信息作为您的个人信息，与您的搜索历史记录一同按照本指引对其进行处理与保护。
			</view>
			<view class="line"> 客户服务：当你向种子会提起投诉、建议、咨询或种子会解决相关投诉问题时，为方便与您联系，我们可能会使用您提供的姓名、手机号码、电子邮箱及其他等个人信息。 </view>
			<view class="line">如您拒绝提供上述信息，我们可能无法向您及时反馈投诉、申诉或咨询结果。 </view>
			<view class="line">向您提供种子会产品和/或服务的附加业务功能 </view>
			<view class="line">为了向您提供更优质的产品和服务，我们可能需要收集下述信息。 如果您拒绝提供下述信息，我们无法向您提供某些特定功能和服务。 </view>
			<view class="line"> 定位功能：GPS地址和位置信息，将用于更方便的计算星座信息；当您开启设备定位功能并使用种子会基于位置提供的相关服务时，我们会收集有关您的位置信息。 </view>
			<view class="line">相册权限：用户可使用app默认头像，如用户自主选择头像，我们将调取相册权限，获悉用户头像选择、更换的头像。 </view>
			<view class="line">按照法律法规要求，下列如下情况我们将无法满足您的上述请求： </view>
			<view class="line">与国家安全、国家利益相关的； </view>
			<view class="line">
				与公共安全、公共利益相关的；
			</view>
			<view class="line">
				与您或者第三方重大利益相关并可能会导致严重损害的；
			</view>
			<view class="line">
				与犯罪、司法程序、政府程序等直接相关的；
			</view>
			<view class="line">
				您存在主观恶意或滥用权利的（如您的请求将危害公共安全和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围）；
			</view>
			<view class="line">
				涉及商业秘密的;
			</view>
			<view class="line">我们如何保护您的个人信息</view>
			<view class="line">为防止您的信息丢失、未经您同意授权的访问、公开披露、泄露、转让等导致您个人信息的受损，种子会平台将采取一切合理、可靠、可行的方案与措施，保障您的个人信息安全。</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				setNav: {
					titleColor: "#fff",
					navTitle: "隐私政策",
					bgColor: "#36c1ba",
					isShowBackBtn: true,
					backBtnColor: "#fff"
				},
			};
		}
	}
</script>

<style lang="scss">
	.container {

		.title {
			font-size: 40rpx;
			font-weight: bold;
			padding: 0 40rpx;
			margin-top: 20rpx;
		}

		.content {
			margin-top: 30rpx;
			padding: 0 40rpx;

			.line {
				text-indent: 2em;
				margin-bottom: 15rpx;
			}
		}
	}
</style>
